garyPenhook/PyAvrOCD/svd/avr32eb28.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x00800600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>Command register</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start command</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop an ongoing conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Start a conversion immediately. This will be set back to STOP when the first conversion is done, unless Free-Running mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXPOS_WRITE</name>
                  <description>Start when MUXPOS register is written</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXNEG_WRITE</name>
                  <description>Start when MUXNEG register is written</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT_TRIGGER</name>
                  <description>Start when an event is received</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_8BIT</name>
                  <description>Single Conversion with 8-bit resolution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_12BIT</name>
                  <description>Single Conversion with 12-bit resolution</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIES</name>
                  <description>Series with accumulation, separate trigger for every 12-bit conversion</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIES_SCALING</name>
                  <description>Series with accumulation and scaling, separate trigger for every 12-bit conversion</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <description>Burst with accumulation, one trigger will run SAMPNUM 12-bit conversions</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST_SCALING</name>
                  <description>Burst with accumulation and scaling, one trigger will run SAMPNUM 12-bit conversions</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFF</name>
              <description>Differential mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ADC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWLAT</name>
              <description>Low Latency</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Prescaler Value</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>System clock divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>System clock divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>System clock divided by 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>System clock divided by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>System clock divided by 10</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>System clock divided by 12</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>System clock divided by 14</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>System clock divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV20</name>
                  <description>System clock divided by 20</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV24</name>
                  <description>System clock divided by 24</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV28</name>
                  <description>System clock divided by 28</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>System clock divided by 32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV40</name>
                  <description>System clock divided by 40</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV48</name>
                  <description>System clock divided by 48</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV56</name>
                  <description>System clock divided by 56</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>System clock divided by 64</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFA</name>
                  <description>External Reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V024</name>
                  <description>Internal 1.024V Reference</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V048</name>
                  <description>Internal 2.048V Reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V096</name>
                  <description>Internal 4.096V Reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V500</name>
                  <description>Internal 2.500V Reference</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINCM</name>
              <description>Window Comparator Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Window Comparison</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Below Window</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Above Window</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Inside Window</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Outside Window</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINSRC</name>
              <description>Window Mode Source</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESULT</name>
                  <description>Result register used as Window Comparator Source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE</name>
                  <description>Sample register used as Window Comparator Source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLE</name>
          <description>Control E</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPDUR</name>
              <description>Sample Duration</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLF</name>
          <description>Control F</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPNUM</name>
              <description>Sample numbers</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No accumulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC2</name>
                  <description>2 samples accumulated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC4</name>
                  <description>4 samples accumulated</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC8</name>
                  <description>8 samples accumulated</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC16</name>
                  <description>16 samples accumulated</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC32</name>
                  <description>32 samples accumulated</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC64</name>
                  <description>64 samples accumulated</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC128</name>
                  <description>128 samples accumulated</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC256</name>
                  <description>256 samples accumulated</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC512</name>
                  <description>512 samples accumulated</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC1024</name>
                  <description>1024 samples accumulated</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEFTADJ</name>
              <description>Left Adjust</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free-Running mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHOPPING</name>
              <description>Sign Chopping</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sign Chopping Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Sign Chopping Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run in Debug Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPRDY</name>
              <description>Sample Ready Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESOVR</name>
              <description>Result Overwrite Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPOVR</name>
              <description>Sample Overwrite Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOVR</name>
              <description>Trigger Overrun Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPRDY</name>
              <description>Sample Ready Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESOVR</name>
              <description>Result Overwrite Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPOVR</name>
              <description>Sample Overwrite Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOVR</name>
              <description>Trigger Overrun Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
